#85
#딕셔너리

# ice = {"메로나 " : 1000, "폴라포" : 1200, "빵빠레" : 1800}
# print(ice)
#다음 아이스크림 이름과 희망 가격을 딕셔너리로 구성하라.



# ice = {"메로나 " : 1000, "폴라포" : 1200, "빵빠레" : 1800}
# ice["죠스바"] = 1200
# ice["월드콘"] = 1500
# print(ice)
#085 번의 딕셔너리에 아래 아이스크림 가격정보를 추가하라.


#다음 딕셔너리를 사용하여 메로나 가격을 출력하라.
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# print("메로나 가격:", ice["메로나"])

# 다음 딕셔너리에서 메로나를 삭제하라.
# ice = {'메로나': 1000,
#        '폴라포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# del ice["메로나"]
# print(ice)

# 리스트를 딕셔너리의 값으로 저장
# inventory = {"메로나": [300,20],
#              "비비빅": [400,3],
#              "죠스바": [250,100]}
# print(inventory)

#딕셔너리 추가
# inventory = {"메로나": [300, 20], 
#              "비비빅": [400, 3], 
#              "죠스바": [250, 100]}
# inventory["월드콘"] = [500,7]
# print(inventory)

# 딕셔너리 keys()메서드
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# ice = list(icecream.keys())
# print(ice)

#딕셔너리 values()메서드
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# print(sum(icecream.values()))

print(3 ==5)
print(3<5)
print((3==3)and(4 !=3))